---
kind: enumMember
id: F:Autodesk.Revit.DB.TransactionStatus.Committed
enum: Autodesk.Revit.DB.TransactionStatus
source: html/29b9a7a8-6754-8310-e063-622b569bb6d5.htm
---
# Autodesk.Revit.DB.TransactionStatus.Committed

simply committed, ended an empty transaction, flushed all, or undo is disabled